package com.xily.dmzj2.data.remote.model


data class SearchABean(
        var Id: Int, // 35229
        var Name: String, // 来自深渊的阿杜
        var Desc: String, // 时至乱世，十二位魔王临世，以强大的战力消灭了世上大半人类。人类的末世降临，无人可抵挡这十二位魔王。正当人类以为将会被灭族的时候。第十二位和十一位魔王，被一位无名英雄所消灭。没人知晓这位无名英雄的身份，无论是人类，还是魔族一方。但惧怕被讨伐的剩余十位魔王们开始隐去了踪迹。16年后，一名名为阿杜的人类集结了勇者，开始讨伐第十位魔王。他自称是人类最后的希望……但第十位魔王的力量实在太过强大，眨眼间就摧毁了阿杜的团队。就在这时候，阿杜说出了自己的身份，他是坐镇深渊的第十二位魔王。而他也是讨伐了第十一位魔王的无名英雄。他与天使缔结了契约，如果把十二阶梯的魔王全部打败的话，他就能够变成人类……
        var Author: String, // 山本晋
        var Status: String // 连载中
)